benchmarks/apis/express/fetch.log
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: benchmark.js
     output: apis/express/fetch.log

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (2m00.0s), 00/30 VUs, 2293233 complete and 0 interrupted iterations
default ✓ [======================================] 30 VUs  2m0s

     data_received..................: 278 kB  2.3 kB/s
     data_sent......................: 1.2 MB  10 kB/s
     http_req_blocked...............: min=0s       max=15.72ms  avg=666ns    med=0s       p(95)=0s     p(99)=0s     
     http_req_connecting............: min=0s       max=15.7ms   avg=568ns    med=0s       p(95)=0s     p(99)=0s     
     http_req_duration..............: min=0s       max=2.09s    avg=413.94µs med=0s       p(95)=0s     p(99)=0s     
       { expected_response:true }...: min=386.28ms max=2.09s    avg=977.84ms med=704ms    p(95)=1.82s  p(99)=1.94s  
     http_req_failed................: 99.96%  ✓ 2292396      ✗ 837 
     http_req_receiving.............: min=0s       max=190.28µs avg=12ns     med=0s       p(95)=0s     p(99)=0s     
     http_req_sending...............: min=0s       max=7.02ms   avg=260ns    med=0s       p(95)=0s     p(99)=0s     
     http_req_tls_handshaking.......: min=0s       max=0s       avg=0s       med=0s       p(95)=0s     p(99)=0s     
     http_req_waiting...............: min=0s       max=2.09s    avg=413.66µs med=0s       p(95)=0s     p(99)=0s     
     http_reqs......................: 2293233 19109.873148/s
     iteration_duration.............: min=77.54µs  max=2.09s    avg=1.56ms   med=111.09µs p(95)=5.36ms p(99)=20.38ms
     iterations.....................: 2293233 19109.873148/s
     vus............................: 30      min=30         max=30
     vus_max........................: 30      min=30         max=30