benchmarks/apis/express/random.log
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: benchmark.js
     output: apis/express/random.log

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (2m00.0s), 00/30 VUs, 2352280 complete and 0 interrupted iterations
default ✓ [======================================] 30 VUs  2m0s

     data_received..................: 289 kB  2.4 kB/s
     data_sent......................: 629 kB  5.2 kB/s
     http_req_blocked...............: min=0s       max=15.21ms  avg=550ns    med=0s       p(95)=0s     p(99)=0s     
     http_req_connecting............: min=0s       max=15.18ms  avg=448ns    med=0s       p(95)=0s     p(99)=0s     
     http_req_duration..............: min=0s       max=2.09s    avg=404.27µs med=0s       p(95)=0s     p(99)=0s     
       { expected_response:true }...: min=163.59ms max=2.09s    avg=964.08ms med=697.77ms p(95)=1.78s  p(99)=1.93s  
     http_req_failed................: 99.96%  ✓ 2351410      ✗ 870 
     http_req_receiving.............: min=0s       max=197.83µs avg=12ns     med=0s       p(95)=0s     p(99)=0s     
     http_req_sending...............: min=0s       max=925.44ms avg=42.07µs  med=0s       p(95)=0s     p(99)=0s     
     http_req_tls_handshaking.......: min=0s       max=0s       avg=0s       med=0s       p(95)=0s     p(99)=0s     
     http_req_waiting...............: min=0s       max=2.09s    avg=362.18µs med=0s       p(95)=0s     p(99)=0s     
     http_reqs......................: 2352280 19602.146092/s
     iteration_duration.............: min=66.29µs  max=2.09s    avg=1.52ms   med=99.51µs  p(95)=5.08ms p(99)=20.56ms
     iterations.....................: 2352280 19602.146092/s
     vus............................: 30      min=30         max=30
     vus_max........................: 30      min=30         max=30